<!DOCTYPE html>
<html lang="es">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Respira - Soporte</title>
  <style>
    body { font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', sans-serif; max-width: 700px; margin: 0 auto; padding: 24px; color: #2D3436; line-height: 1.6; }
    h1 { color: #7C9A82; }
    h2 { color: #5A7A60; margin-top: 32px; }
    p { margin: 12px 0; }
    .faq { background: #f8f9fa; border-radius: 8px; padding: 16px; margin: 12px 0; }
    .faq strong { display: block; margin-bottom: 6px; }
    a { color: #7C9A82; }
    .contact-box { background: #7C9A82; color: white; padding: 24px; border-radius: 12px; margin-top: 32px; text-align: center; }
    .contact-box a { color: white; font-weight: bold; }
  </style>
</head>
<body>
  <h1>Soporte - Respira</h1>
  <p>Estamos aqu&#237; para ayudarte. Consulta las preguntas frecuentes o cont&#225;ctanos directamente.</p>

  <h2>Preguntas frecuentes</h2>

  <div class="faq">
    <strong>&#191;De d&#243;nde obtiene Respira los datos de polen?</strong>
    Los datos provienen de la Open-Meteo Air Quality API y la Red Espa&#241;ola de Aerobiolog&#237;a (REA). Se actualizan autom&#225;ticamente cada vez que abres la app o haces pull-to-refresh.
  </div>

  <div class="faq">
    <strong>&#191;Puedo usar la app sin crear una cuenta?</strong>
    Actualmente necesitas una cuenta para usar Respira. Puedes registrarte con tu email, Google o Apple.
  </div>

  <div class="faq">
    <strong>&#191;C&#243;mo cambio mi ubicaci&#243;n?</strong>
    Ve a la pesta&#241;a de Perfil y pulsa en "Ciudad" dentro de la secci&#243;n "Mi ubicaci&#243;n". Podr&#225;s buscar y seleccionar una nueva ciudad.
  </div>

  <div class="faq">
    <strong>&#191;C&#243;mo configuro recordatorios de medicaci&#243;n?</strong>
    En la pesta&#241;a de Diario, pulsa el icono de pastilla para a&#241;adir un recordatorio. Puedes configurar el nombre del medicamento y la frecuencia en horas.
  </div>

  <div class="faq">
    <strong>&#191;C&#243;mo elimino mi cuenta?</strong>
    Ve a Perfil &gt; Cuenta &gt; "Eliminar mi cuenta". Se te pedir&#225; confirmaci&#243;n dos veces antes de proceder. Todos tus datos se eliminar&#225;n permanentemente.
  </div>

  <div class="faq">
    <strong>Los datos de polen no parecen correctos para mi zona</strong>
    Algunos tipos de polen (cipr&#233;s, pl&#225;tano de sombra, ariz&#243;nicas, parietaria) se estiman en base a calendarios de polinizaci&#243;n y pueden no reflejar las condiciones exactas de tu zona. Los dem&#225;s tipos provienen de estaciones de monitorizaci&#243;n cercanas.
  </div>

  <div class="faq">
    <strong>&#191;Se comparten mis datos con terceros?</strong>
    No. Tus datos personales y tu diario de salud son privados. No vendemos, compartimos ni cedemos tus datos a terceros. Consulta nuestra <a href="index.html">Pol&#237;tica de Privacidad</a> para m&#225;s detalles.
  </div>

  <div class="contact-box">
    <p>&#191;No encuentras lo que buscas?</p>
    <p>Escr&#237;benos a <a href="mailto:respiraapp.info@gmail.com">respiraapp.info@gmail.com</a></p>
    <p style="font-size: 14px; opacity: 0.8; margin-top: 8px;">Intentamos responder en menos de 48 horas.</p>
  </div>

</body>
</html>
